src/Catalogs/СпособыОтраженияЗарплатыВБухУчете/СпособыОтраженияЗарплатыВБухУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыОтраженияЗарплатыВБухУчете</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОплатаСдельныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятиеКНалоговомуУчетуПоСдельнымРаботам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРаспределенияПоСдельнымРаботам</name>
    <type>
      <types>EnumRef.ТипыБазыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельнаяСтатьяКалькуляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельнаяСтатьяКалькуляцииВзносов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляцииВзносов</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСчетовУчета</name>
    <type>
      <types>CatalogRef.НастройкиСчетовУчетаПрочихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимУчетаВзносов</name>
    <comment>0 - совпадает с зарплатой, 1 - все взносы на отдельной статье</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовВзносов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовВзносов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивовВзносов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСчетовУчетаВзносов</name>
    <type>
      <types>CatalogRef.НастройкиСчетовУчетаПрочихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыйСоответствуетОсновному</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовЕНВД</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовЕНВД</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивовЕНВД</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСчетовУчетаЕНВД</name>
    <type>
      <types>CatalogRef.НастройкиСчетовУчетаПрочихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимУчетаВзносовЕНВД</name>
    <comment>0 - совпадает с зарплатой, 1 - все взносы на отдельной статье</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовВзносовЕНВД</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовВзносовЕНВД</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивовВзносовЕНВД</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСчетовУчетаВзносовЕНВД</name>
    <type>
      <types>CatalogRef.НастройкиСчетовУчетаПрочихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимУчетаВзносовНаТравматизм</name>
    <comment>0 - совпадает с зарплатой, 1 - на отдельную статью</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовТравматизм</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовТравматизм</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивовТравматизм</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСчетовУчетаТравматизм</name>
    <type>
      <types>CatalogRef.НастройкиСчетовУчетаПрочихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПрочиеОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПринятиеКНалоговомуУчетуПоСдельнымРаботамНеТребуетОбновления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/СпособыОтраженияЗарплатыВБухУчете/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает текст запроса для получения параметров способа отражения.
//	Параметры:
//		ИмяВременнойТаблицы - Строка - имя таблицы, если требуется помещения результата во временную таблицу.
//	Возвращаемое значение:
//		Строка - текст запроса.
//
Функция ТекстЗапросаДанныхСпособов(ИмяВременнойТаблицы = "") Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СписокСпособов.СпособОтражения,
	|	ЛОЖЬ КАК ОблагаетсяЕНВД,
	|	СпособОтраженияЗарплата.ОплатаСдельныхРабот КАК ОплатаСдельныхРабот,
	
	|	СпособОтраженияЗарплата.БазаРаспределенияПоСдельнымРаботам КАК БазаРаспределения,
	|	СпособОтраженияЗарплата.ОтдельнаяСтатьяКалькуляции КАК ОтдельнаяСтатьяКалькуляции,
	|	СпособОтраженияЗарплата.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	СпособОтраженияЗарплата.ОтдельнаяСтатьяКалькуляцииВзносов КАК ОтдельнаяСтатьяКалькуляцииВзносов,
	|	СпособОтраженияЗарплата.СтатьяКалькуляцииВзносов КАК СтатьяКалькуляцииВзносов,
	
	|	СпособОтраженияЗарплата.СтатьяРасходов КАК СтатьяРасходов,
	|	СпособОтраженияЗарплата.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СпособОтраженияЗарплата.СтатьяРасходов.ВариантРаспределенияРасходовРегл КАК ВариантРаспределения,
	|	ВЫБОР
	|		КОГДА НЕ СпособОтраженияЗарплата.ОплатаСдельныхРабот
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходов.ПринятиеКналоговомуУчету
	|		ИНАЧЕ СпособОтраженияЗарплата.ПринятиеКНалоговомуУчетуПоСдельнымРаботам
	|	КОНЕЦ КАК ПринятиеКналоговомуУчету,
	|	СпособОтраженияЗарплата.АналитикаРасходов КАК АналитикаРасходов,
	|	СпособОтраженияЗарплата.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчета КАК НастройкаСчетовУчета,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчета.СчетУчета КАК СчетУчета,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчета.Субконто1 КАК Субконто1,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчета.Субконто2 КАК Субконто2,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчета.Субконто3 КАК Субконто3,
	
	|	СпособОтраженияЗарплата.СтатьяРасходовВзносов КАК СтатьяРасходовВзносов,
	|	СпособОтраженияЗарплата.СтатьяРасходовВзносов.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияВзносов,
	|	СпособОтраженияЗарплата.СтатьяРасходовВзносов.ПринятиеКналоговомуУчету КАК ПринятиеКналоговомуУчетуВзносов,
	|	СпособОтраженияЗарплата.АналитикаРасходовВзносов КАК АналитикаРасходовВзносов,
	|	СпособОтраженияЗарплата.АналитикаАктивовПассивовВзносов КАК АналитикаАктивовПассивовВзносов,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносов КАК НастройкаСчетовУчетаВзносов,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносов.СчетУчета КАК СчетУчетаВзносов,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносов.Субконто1 КАК Субконто1Взносов,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносов.Субконто2 КАК Субконто2Взносов,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносов.Субконто3 КАК Субконто3Взносов,
	
	// взносы травматизм
	|	СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм КАК РежимУчетаВзносовНаТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходовТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.СтатьяРасходовВзносов
	|	КОНЕЦ                                    КАК СтатьяРасходовТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходовТравматизм.ВариантРаспределенияРасходовРегл
	|		ИНАЧЕ СпособОтраженияЗарплата.СтатьяРасходовВзносов.ВариантРаспределенияРасходовРегл
	|	КОНЕЦ                                    КАК ВариантРаспределенияТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходовТравматизм.ПринятиеКналоговомуУчету
	|		ИНАЧЕ СпособОтраженияЗарплата.СтатьяРасходовВзносов.ПринятиеКналоговомуУчету
	|	КОНЕЦ                                    КАК ПринятиеКналоговомуУчетуТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.АналитикаРасходовТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.АналитикаРасходовВзносов
	|	КОНЕЦ                                    КАК АналитикаРасходовТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.АналитикаАктивовПассивовТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.АналитикаАктивовПассивовВзносов
	|	КОНЕЦ                                    КАК АналитикаАктивовПассивовТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.НастройкаСчетовУчетаТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносов
	|	КОНЕЦ                                    КАК НастройкаСчетовУчетаТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.НастройкаСчетовУчетаТравматизм.СчетУчета
	|		ИНАЧЕ СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносов.СчетУчета
	|	КОНЕЦ                                    КАК СчетУчетаТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.НастройкаСчетовУчетаТравматизм.Субконто1
	|		ИНАЧЕ СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносов.Субконто1
	|	КОНЕЦ                                    КАК Субконто1Травматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.НастройкаСчетовУчетаТравматизм.Субконто2
	|		ИНАЧЕ СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносов.Субконто2
	|	КОНЕЦ                                    КАК Субконто2Травматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.НастройкаСчетовУчетаТравматизм.Субконто3
	|		ИНАЧЕ СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносов.Субконто3
	|	КОНЕЦ                                    КАК Субконто3Травматизм
	
	|//ПоместитьВоВременнуюТаблицу
	|ИЗ
	|	ВтСписокСпособовОтражения КАК СписокСпособов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплата
	|		ПО СписокСпособов.СпособОтражения = СпособОтраженияЗарплата.Ссылка
	|ГДЕ
	|	СписокСпособов.СпособОтражения <> Значение(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокСпособов.СпособОтражения,
	|	ИСТИНА,
	|	СпособОтраженияЗарплата.ОплатаСдельныхРабот,
	
	|	СпособОтраженияЗарплата.БазаРаспределенияПоСдельнымРаботам КАК БазаРаспределения,
	|	СпособОтраженияЗарплата.ОтдельнаяСтатьяКалькуляции КАК ОтдельнаяСтатьяКалькуляции,
	|	СпособОтраженияЗарплата.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	СпособОтраженияЗарплата.ОтдельнаяСтатьяКалькуляцииВзносов КАК ОтдельнаяСтатьяКалькуляцииВзносов,
	|	СпособОтраженияЗарплата.СтатьяКалькуляцииВзносов КАК СтатьяКалькуляцииВзносов,
	
	|	СпособОтраженияЗарплата.СтатьяРасходовЕНВД,
	|	СпособОтраженияЗарплата.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СпособОтраженияЗарплата.СтатьяРасходовЕНВД.ВариантРаспределенияРасходовРегл,
	|	ВЫБОР
	|		КОГДА НЕ СпособОтраженияЗарплата.ОплатаСдельныхРабот
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходовЕНВД.ПринятиеКналоговомуУчету
	|		ИНАЧЕ СпособОтраженияЗарплата.ПринятиеКНалоговомуУчетуПоСдельнымРаботам
	|	КОНЕЦ,
	|	СпособОтраженияЗарплата.АналитикаРасходовЕНВД,
	|	СпособОтраженияЗарплата.АналитикаАктивовПассивовЕНВД,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаЕНВД,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаЕНВД.СчетУчета,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаЕНВД.Субконто1,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаЕНВД.Субконто2,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаЕНВД.Субконто3,
	
	|	СпособОтраженияЗарплата.СтатьяРасходовВзносовЕНВД,
	|	СпособОтраженияЗарплата.СтатьяРасходовВзносовЕНВД.ВариантРаспределенияРасходовРегл,
	|	СпособОтраженияЗарплата.СтатьяРасходовВзносовЕНВД.ПринятиеКналоговомуУчету,
	|	СпособОтраженияЗарплата.АналитикаРасходовВзносовЕНВД,
	|	СпособОтраженияЗарплата.АналитикаАктивовПассивовВзносовЕНВД,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносовЕНВД,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносовЕНВД.СчетУчета,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносовЕНВД.Субконто1,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносовЕНВД.Субконто2,
	|	СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносовЕНВД.Субконто3,
	
	// взносы травматизм
	|	СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходовТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.СтатьяРасходовВзносовЕНВД
	|	КОНЕЦ                                    КАК СтатьяРасходовТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходовТравматизм.ВариантРаспределенияРасходовРегл
	|		ИНАЧЕ СпособОтраженияЗарплата.СтатьяРасходовВзносовЕНВД.ВариантРаспределенияРасходовРегл
	|	КОНЕЦ                                    КАК ВариантРаспределенияТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.СтатьяРасходовТравматизм.ПринятиеКналоговомуУчету
	|		ИНАЧЕ СпособОтраженияЗарплата.СтатьяРасходовВзносовЕНВД.ПринятиеКналоговомуУчету
	|	КОНЕЦ                                    КАК ПринятиеКналоговомуУчетуТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.АналитикаРасходовТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.АналитикаРасходовВзносовЕНВД
	|	КОНЕЦ                                    КАК АналитикаРасходовТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.АналитикаАктивовПассивовТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.АналитикаАктивовПассивовВзносовЕНВД
	|	КОНЕЦ                                    КАК АналитикаАктивовПассивовТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.НастройкаСчетовУчетаТравматизм
	|		ИНАЧЕ СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносовЕНВД
	|	КОНЕЦ                                    КАК НастройкаСчетовУчетаТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.НастройкаСчетовУчетаТравматизм.СчетУчета
	|		ИНАЧЕ СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносовЕНВД.СчетУчета
	|	КОНЕЦ                                    КАК СчетУчетаТравматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.НастройкаСчетовУчетаТравматизм.Субконто1
	|		ИНАЧЕ СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносовЕНВД.Субконто1
	|	КОНЕЦ                                    КАК Субконто1Травматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.НастройкаСчетовУчетаТравматизм.Субконто2
	|		ИНАЧЕ СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносовЕНВД.Субконто2
	|	КОНЕЦ                                    КАК Субконто2Травматизм,
	|	ВЫБОР
	|		КОГДА СпособОтраженияЗарплата.РежимУчетаВзносовНаТравматизм = 1
	|			ТОГДА СпособОтраженияЗарплата.НастройкаСчетовУчетаТравматизм.Субконто3
	|		ИНАЧЕ СпособОтраженияЗарплата.НастройкаСчетовУчетаВзносовЕНВД.Субконто3
	|	КОНЕЦ                                    КАК Субконто3Травматизм
	
	|ИЗ
	|	ВтСписокСпособовОтражения КАК СписокСпособов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплата
	|		ПО СписокСпособов.СпособОтражения = СпособОтраженияЗарплата.Ссылка
	|ГДЕ
	|	СписокСпособов.СпособОтражения <> Значение(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка)";
	
	Если ЗначениеЗаполнено(ИмяВременнойТаблицы) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПоместитьВоВременнуюТаблицу", "ПОМЕСТИТЬ " + ИмяВременнойТаблицы);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПоместитьВоВременнуюТаблицу", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает массив блокируемых реквизитов объекта.
//	Возвращаемое значение:
//		Массив из Строка - имена реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("НаправлениеДеятельности");
	Результат.Добавить("СтатьяРасходов");
	Результат.Добавить("АналитикаРасходов");
	Результат.Добавить("АналитикаАктивовПассивов");
	Результат.Добавить("РежимУчетаВзносов");
	Результат.Добавить("СтатьяРасходовВзносов");
	Результат.Добавить("АналитикаРасходовВзносов");
	Результат.Добавить("АналитикаАктивовПассивовВзносов");
	Результат.Добавить("ОсобыйСоответствуетОсновному");
	Результат.Добавить("СтатьяРасходовЕНВД");
	Результат.Добавить("АналитикаРасходовЕНВД");
	Результат.Добавить("АналитикаАктивовПассивовЕНВД");
	Результат.Добавить("РежимУчетаВзносовЕНВД");
	Результат.Добавить("СтатьяРасходовВзносовЕНВД");
	Результат.Добавить("АналитикаРасходовВзносовЕНВД");
	Результат.Добавить("АналитикаАктивовПассивовВзносовЕНВД");
	Результат.Добавить("ОтдельнаяСтатьяКалькуляции");
	Результат.Добавить("СтатьяКалькуляции");
	Результат.Добавить("ОтдельнаяСтатьяКалькуляцииВзносов");
	Результат.Добавить("БазаРаспределенияПоСдельнымРаботам");
	Результат.Добавить("ПринятиеКНалоговомуУчетуПоСдельнымРаботам");
	Результат.Добавить("РежимУчетаВзносовНаТравматизм");
	Результат.Добавить("СтатьяРасходовТравматизм");
	Результат.Добавить("АналитикаРасходовТравматизм");
	Результат.Добавить("АналитикаАктивовПассивовТравматизм");
	
	Результат.Добавить("ОплатаСдельныхРабот;ХарактерНачисления");
	
	Возврат Результат;
	
КонецФункции

// Проверяет использование объекта в документах Отражение зарплаты в финансовом учете и Начисление оценочных обязательств.
//	Параметры:
//		Параметры - Структура - структура, содержащая ссылку на проверяемый объект.
//		АдресХранилища - Строка - адрес, по которому следует поместить результат проверки.
//
Процедура ПроверитьИспользованиеОбъекта(Параметры, АдресХранилища) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	Зарплата.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленнаяЗарплатаИВзносы КАК Зарплата
	|ГДЕ
	|	Зарплата.Ссылка.Проведен
	|	И Зарплата.СпособОтраженияЗарплатыВБухучете = &Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	Резервы.Ссылка
	|ИЗ
	|	Документ.НачислениеОценочныхОбязательствПоОтпускам.ОценочныеОбязательства КАК Резервы
	|ГДЕ
	|	Резервы.Ссылка.Проведен
	|	И Резервы.СпособОтраженияЗарплатыВБухучете = &Объект");
	
	Запрос.УстановитьПараметр("Объект", Параметры.Объект);
	Результат = Запрос.Выполнить();
	
	ПоместитьВоВременноеХранилище(Не Результат.Пустой(), АдресХранилища);
	
КонецПроцедуры

#Область Прочее

// Возвращает параметры выбора статей для элемента справочника.
//
// Возвращаемое значение:
//   Массив из см.ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики - параметры выбора статей и аналитик.
//
Функция ПараметрыВыбораСтатейИАналитик() Экспорт
	
	МассивПараметров = Новый Массив;
	
	#Область Параметры_выбора_статьи_расходов
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект";
	ПараметрыВыбора.Статья      = "СтатьяРасходов";
	ПараметрыВыбора.ТипСтатьи   = "ТипСтатьиРасходов";
	ПараметрыВыбора.ЗначениеПоУмолчанию = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходов";
	
	ПараметрыВыбора.ВыборСтатьиАктивовПассивов = Истина;
	ПараметрыВыбора.АналитикаАктивовПассивов = "АналитикаАктивовПассивов";
	
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("СтатьяРасходов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("АналитикаРасходов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаАктивовПассивов.Добавить("АналитикаАктивовПассивов");
	
	МассивПараметров.Добавить(ПараметрыВыбора);
	#КонецОбласти
	
	#Область Параметры_выбора_статьи_расходов_ЕНВД
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект";
	ПараметрыВыбора.Статья      = "СтатьяРасходовЕНВД";
	ПараметрыВыбора.ТипСтатьи   = "ТипСтатьиРасходовЕНВД";
	ПараметрыВыбора.ЗначениеПоУмолчанию = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходовЕНВД";
	
	ПараметрыВыбора.ВыборСтатьиАктивовПассивов = Истина;
	ПараметрыВыбора.АналитикаАктивовПассивов = "АналитикаАктивовПассивовЕНВД";
	
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("СтатьяРасходовЕНВД");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("АналитикаРасходовЕНВД");
	ПараметрыВыбора.ЭлементыФормы.АналитикаАктивовПассивов.Добавить("АналитикаАктивовПассивовЕНВД");
	
	МассивПараметров.Добавить(ПараметрыВыбора);
	#КонецОбласти
	
	#Область Параметры_выбора_статьи_расходов_взносов
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект";
	ПараметрыВыбора.Статья      = "СтатьяРасходовВзносов";
	ПараметрыВыбора.ТипСтатьи   = "ТипСтатьиРасходовВзносов";
	ПараметрыВыбора.ЗначениеПоУмолчанию = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходовВзносов";
	
	ПараметрыВыбора.ВыборСтатьиАктивовПассивов = Истина;
	ПараметрыВыбора.АналитикаАктивовПассивов = "АналитикаАктивовПассивовВзносов";
	
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("СтатьяРасходовВзносов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("АналитикаРасходовВзносов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаАктивовПассивов.Добавить("АналитикаАктивовПассивовВзносов");
	
	МассивПараметров.Добавить(ПараметрыВыбора);
	#КонецОбласти
	
	#Область Параметры_выбора_статьи_расходов_взносов_ЕНВД
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект";
	ПараметрыВыбора.Статья      = "СтатьяРасходовВзносовЕНВД";
	ПараметрыВыбора.ТипСтатьи   = "ТипСтатьиРасходовВзносовЕНВД";
	ПараметрыВыбора.ЗначениеПоУмолчанию = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходовВзносовЕНВД";
	
	ПараметрыВыбора.ВыборСтатьиАктивовПассивов = Истина;
	ПараметрыВыбора.АналитикаАктивовПассивов = "АналитикаАктивовПассивовВзносовЕНВД";
	
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("СтатьяРасходовВзносовЕНВД");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("АналитикаРасходовВзносовЕНВД");
	ПараметрыВыбора.ЭлементыФормы.АналитикаАктивовПассивов.Добавить("АналитикаАктивовПассивовВзносовЕНВД");
	
	МассивПараметров.Добавить(ПараметрыВыбора);
	#КонецОбласти
	
	#Область Параметры_выбора_статьи_расходов_травматизм
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект";
	ПараметрыВыбора.Статья      = "СтатьяРасходовТравматизм";
	ПараметрыВыбора.ТипСтатьи   = "ТипСтатьиРасходовТравматизм";
	ПараметрыВыбора.ЗначениеПоУмолчанию = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходовТравматизм";
	
	ПараметрыВыбора.ВыборСтатьиАктивовПассивов = Истина;
	ПараметрыВыбора.АналитикаАктивовПассивов = "АналитикаАктивовПассивовТравматизм";
	
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("СтатьяРасходовТравматизм");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("АналитикаРасходовТравматизм");
	ПараметрыВыбора.ЭлементыФормы.АналитикаАктивовПассивов.Добавить("АналитикаАктивовПассивовТравматизм");
	
	МассивПараметров.Добавить(ПараметрыВыбора);
	#КонецОбласти
	
	Возврат МассивПараметров;
	
КонецФункции

// Возвращает параметры настройки счетов учета.
//
// Возвращаемое значение:
//   Массив из см.НастройкаСчетовУчетаСервер.ПараметрыНастройки - параметры настройки счетов учета.
//
Функция ПараметрыНастройкиСчетовУчета() Экспорт
	
	МассивПараметров = Новый Массив;
	
	#Область НастройкаСчетаУчета
	ПараметрыНастройки = НастройкаСчетовУчетаСервер.ПараметрыНастройки();
	ПараметрыНастройки.ПутьКДанным = "Объект";
	ПараметрыНастройки.НастройкаСчетовУчета     = "НастройкаСчетовУчета";
	ПараметрыНастройки.СтатьяАктивовПассивов    = "СтатьяРасходов";
	ПараметрыНастройки.АналитикаАктивовПассивов = "АналитикаАктивовПассивов";
	ПараметрыНастройки.ТипСтатьи     = "ТипСтатьиРасходов";
	ПараметрыНастройки.Представление = "НастроитьОтражениеВРеглУчете";
	ПараметрыНастройки.Организация   = "";
	
	ПараметрыНастройки.ИсточникиПодбораСубконто.ЗагрузитьЗначения(ПодбираемыеАналитики());
	
	ПараметрыНастройки.ЭлементыФормы.Добавить("НастроитьОтражениеВРеглУчете");
	
	МассивПараметров.Добавить(ПараметрыНастройки);
	#КонецОбласти
	
	#Область НастройкаСчетаУчетаЕНВД
	ПараметрыНастройки = НастройкаСчетовУчетаСервер.ПараметрыНастройки();
	ПараметрыНастройки.ПутьКДанным = "Объект";
	ПараметрыНастройки.НастройкаСчетовУчета     = "НастройкаСчетовУчетаЕНВД";
	ПараметрыНастройки.СтатьяАктивовПассивов    = "СтатьяРасходовЕНВД";
	ПараметрыНастройки.АналитикаАктивовПассивов = "АналитикаАктивовПассивовЕНВД";
	ПараметрыНастройки.ТипСтатьи     = "ТипСтатьиРасходовЕНВД";
	ПараметрыНастройки.Представление = "НастроитьОтражениеВРеглУчетеЕНВД";
	ПараметрыНастройки.Организация = "";

	ПараметрыНастройки.ИсточникиПодбораСубконто.ЗагрузитьЗначения(ПодбираемыеАналитики());
	
	ПараметрыНастройки.ЭлементыФормы.Добавить("НастроитьОтражениеВРеглУчетеЕНВД");
	
	МассивПараметров.Добавить(ПараметрыНастройки);
	#КонецОбласти
	
	#Область НастройкаСчетаУчетаВзносов
	ПараметрыНастройки = НастройкаСчетовУчетаСервер.ПараметрыНастройки();
	ПараметрыНастройки.ПутьКДанным = "Объект";
	ПараметрыНастройки.НастройкаСчетовУчета     = "НастройкаСчетовУчетаВзносов";
	ПараметрыНастройки.СтатьяАктивовПассивов    = "СтатьяРасходовВзносов";
	ПараметрыНастройки.АналитикаАктивовПассивов = "АналитикаАктивовПассивовВзносов";
	ПараметрыНастройки.ТипСтатьи     = "ТипСтатьиРасходовВзносов";
	ПараметрыНастройки.Представление = "НастроитьОтражениеВРеглУчетеВзносов";
	ПараметрыНастройки.Организация = "";
	
	ПараметрыНастройки.ИсточникиПодбораСубконто.ЗагрузитьЗначения(ПодбираемыеАналитики());
	
	ПараметрыНастройки.ЭлементыФормы.Добавить("НастроитьОтражениеВРеглУчетеВзносов");
	
	МассивПараметров.Добавить(ПараметрыНастройки);
	#КонецОбласти
	
	#Область НастройкаСчетаУчетаВзносовЕНВД
	ПараметрыНастройки = НастройкаСчетовУчетаСервер.ПараметрыНастройки();
	ПараметрыНастройки.ПутьКДанным = "Объект";
	ПараметрыНастройки.НастройкаСчетовУчета     = "НастройкаСчетовУчетаВзносовЕНВД";
	ПараметрыНастройки.СтатьяАктивовПассивов    = "СтатьяРасходовВзносовЕНВД";
	ПараметрыНастройки.АналитикаАктивовПассивов = "АналитикаАктивовПассивовВзносовЕНВД";
	ПараметрыНастройки.ТипСтатьи     = "ТипСтатьиРасходовВзносовЕНВД";
	ПараметрыНастройки.Представление = "НастроитьОтражениеВРеглУчетеВзносовЕНВД";
	ПараметрыНастройки.Организация = "";
	
	ПараметрыНастройки.ИсточникиПодбораСубконто.ЗагрузитьЗначения(ПодбираемыеАналитики());
	
	ПараметрыНастройки.ЭлементыФормы.Добавить("НастроитьОтражениеВРеглУчетеВзносовЕНВД");
	
	МассивПараметров.Добавить(ПараметрыНастройки);
	#КонецОбласти
	
	#Область НастройкаСчетаУчетаВзносов
	ПараметрыНастройки = НастройкаСчетовУчетаСервер.ПараметрыНастройки();
	ПараметрыНастройки.ПутьКДанным = "Объект";
	ПараметрыНастройки.НастройкаСчетовУчета     = "НастройкаСчетовУчетаТравматизм";
	ПараметрыНастройки.СтатьяАктивовПассивов    = "СтатьяРасходовТравматизм";
	ПараметрыНастройки.АналитикаАктивовПассивов = "АналитикаАктивовПассивовТравматизм";
	ПараметрыНастройки.ТипСтатьи     = "ТипСтатьиРасходовТравматизм";
	ПараметрыНастройки.Представление = "НастроитьОтражениеВРеглУчетеТравматизм";
	ПараметрыНастройки.Организация = "";
	
	ПараметрыНастройки.ИсточникиПодбораСубконто.ЗагрузитьЗначения(ПодбираемыеАналитики());
	
	ПараметрыНастройки.ЭлементыФормы.Добавить("НастроитьОтражениеВРеглУчетеТравматизм");
	
	МассивПараметров.Добавить(ПараметрыНастройки);
	#КонецОбласти
	
	Возврат МассивПараметров;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПодбираемыеАналитики() Экспорт
	
	ПодбираемыеАналитики = Новый Массив;
	ПодбираемыеАналитики.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	ПодбираемыеАналитики.Добавить(Тип("СправочникСсылка.ОбъектыЭксплуатации"));
	ПодбираемыеАналитики.Добавить(Тип("СправочникСсылка.Организации"));
	ПодбираемыеАналитики.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
	ПодбираемыеАналитики.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
	
	Возврат ПодбираемыеАналитики;
	
КонецФункции

#КонецОбласти

#КонецЕсли
